from string import Template

system_prompt = Template(
    """
أنت مساعد يقوم بإنشاء إجابات للمستخدم.
سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.
يجب أن تعتمد إجابتك على المستندات المقدمة فقط.
تجاهل المستندات غير المرتبطة بسؤال المستخدم.
إذا لم تتمكن من الإجابة باستخدام المستندات المقدمة، اعتذر للمستخدم.
أجب بنفس لغة سؤال المستخدم.
كن مهذبًا ومحترمًا مع المستخدم.
كن دقيقًا ومختصرًا وتجنب المعلومات غير الضرورية.
""".strip()
)


document_prompt = Template(
    """
## المستند رقم: $doc_num
### المحتوى: $chunk_text
""".strip()
)


footer_prompt = Template(
    """
بناءً على المستندات أعلاه فقط، قم بإنشاء إجابة للمستخدم.
## السؤال:
$query

## الإجابة:
""".strip()
)
